{"notes":[{"id":45,"content":"Framework for presenting to others. This assumes the presentation has a call to action.\n1. Why does it matter to you?\n2. Why should it matter to the person listening to you?\n3. Why should we do it now?","source":"Vivek Murthy","variant":"regular"},{"id":47,"content":"A teacher's effectiveness is correlated to their ability to persuade their audience to care about the subject.","source":"ChooseFI podcase Episode: The Simple Startup","variant":"regular"},{"id":51,"content":"Understanding your audience is important to effective teaching. Knowledge of an audience can directly increase a teacher's ability to motivate that audience to act/learn. This can be as important as a teacher's knowledge of the actual subject matter.","source":"ChooseFI podcase Episode: The Simple Startup","variant":"regular"},{"id":56,"content":"Simplicity is an attractive and sought after attribute. It is also hard to define. In business, simplicity leads to adaptability, eases communication, spurs action, and is understandable.","source":"Start Something That Matters","variant":"regular"},{"id":62,"content":"We rely heavily on other's knowledge in society. This is referred to as Epistiemic dependence. We overestimate the individuals ability to amass information and underestimate society's role in processing it. Knowledge of the world depends as much on trust and relationships as textbooks and observations.","source":"Why you don’t really know what you know","variant":"regular"},{"id":64,"content":"Scientific fields have become so narrowly specialized that collaboration is necessary for big projects.","source":"Why you don’t really know what you know","variant":"regular"},{"id":67,"content":"We often overestimate our ability to explain things. This is referred to as the illusion of explanatory depth. Because of epistemic dependence, we often don't actually \"know,\" (knowledge == facts you can support with data and logic) that much and it is put to the test when we must explain something in great detail.","source":"Why you don’t really know what you know","variant":"regular"},{"id":70,"content":"Transactive memory is the phenomenon of knowing who knows certain information. This is observed in cases of subconsciously remembering more facts about a situation in which your partner is not an expert.","source":"Why you don’t really know what you know","variant":"regular"},{"id":72,"content":"The servant leader is a leader whose focus is shifted from a profitable, thriving company to a leader that serves his followers and customers. This leadership style builds a foundation of trust in employees.","source":"Start Something That Matters","variant":"regular"},{"id":74,"content":"A company with a culture of trust has higher chances of sustained success. This is because trust is transformative to employees and customers. Employees are retained for longer and become more productive. Customers continually support companies they have high trust in.","source":"Start Something That Matters","variant":"regular"},{"id":78,"content":"Mistakes are important to long term success because we learn from mistakes more than learning from success. ","source":"Start Something That Matters","variant":"regular"},{"id":79,"content":"In organizations, allowing members to make mistakes and being open about mistakes builds a foundation of trust and learning in the organization.","source":"Start Something That Matters","variant":"regular"},{"id":82,"content":"People want to work for and with companies that stand behind social causes. Therefore, companies will have more success by merging social and economic priorities. ","source":"Start Something That Matters","variant":"regular"},{"id":87,"content":"A collection of talented people focused around a particular area or topic can be a very valuable asset.","source":"What is Success","variant":"regular"},{"id":89,"content":"A narrative/story has greater influence on people than facts.","source":"Start Something That Matters","variant":"regular"},{"id":96,"content":"The Ziegarnik effect is the tendency to remember interrupted or incomplete tasks more easily than tasks that have been completed or marked for later. Tasks linger in thought and are worked on in the background while pursuing other things. Tasks can be cleared from the mind by writing them down to do later or finishing them.","source":"How to Take Smart Notes ","variant":"regular"},{"id":100,"content":"The difference between a tinkerer and entrepreneur is entrepreneurs solve problems for themselves and others while tinkerers solve problems for themselves.","source":"How I Built This","variant":"regular"},{"id":102,"content":"Building passion for your idea in others is as important as harnessing your own passion.","source":"How I Built This","variant":"regular"},{"id":104,"content":"Successful founders are deeply knowledgeable about their domain. This gives them good base of knowledge to innovate against.","source":"How I Built This","variant":"regular"},{"id":106,"content":"Successful founders often did not know anything about their domain to start. This gives them the advantage of not having any biases or assumptions. They can freely challenge convention and question assumptions without the biases of being an expert.","source":"How I Built This","variant":"regular"},{"id":109,"content":"Cofounders are essential to starting something, especially if that cofounder has a different skillset and perspective. They offer immediate feedback, a different perspective, and someone to trust.","source":"How I Built This","variant":"regular"},{"id":111,"content":"Bootstrapping successfully for a long time is indicative of future success.\n","source":"How I Built This","variant":"regular"},{"id":113,"content":"Bootstrapping is personal financing a project through any means possible. This can include personal funds, tapping connections, personal time, ingenuity, etc.","source":"How I Built This","variant":"regular"},{"id":116,"content":"A straightforward way of understanding a user's mental model is to ask them to accomplish certain tasks on your website and see what they do.","source":"How I Built This","variant":"regular"}],"links":[{"id":114,"sourceId":113,"targetId":111},{"id":107,"sourceId":106,"targetId":104},{"id":92,"sourceId":62,"targetId":89},{"id":80,"sourceId":78,"targetId":79},{"id":75,"sourceId":72,"targetId":74},{"id":68,"sourceId":67,"targetId":62},{"id":65,"sourceId":64,"targetId":62},{"id":54,"sourceId":47,"targetId":51},{"id":52,"sourceId":51,"targetId":45}],"sources":[{"id":98,"title":"How I Built This","author":"Guy Raz","content":"There are many different motivations leading to entrepreneurship and ideas can come from many places. A tinkerer solves problems for themselves. An entrepreneur solves problems for themselves and others. Building passion for your ideas in others can be just as important as harnessing your own passion.\n\nPeople are more relaxed with what is familiar. Scary things often lead to inaction. Uncharted territory like starting a business and leaving a stable paycheck is unfamiliar and scary. However, regretting inaction can be dangerous.\n\nThere are two common patterns when quitting the \"real\" job to go on an entrepreneurial adventure that are \"safe\" exists.\n1. Quit when the time demanded of the venture requires it.\n2. Have a fallback plan should the venture fail.\n\nMost successful founders are deeply knowledgeable about their domain. This gives them the basis of knowledge to innovate against and allows them to trust their instincts. Often founders start with no knowledge in their domain. This can be an advantage. Not knowing anything allows more freedom to challenge convention question assumptions more readily.\n\nCofounders are essential. Better for a cofounder to be your opposite with a different skillsets. They offer immediate feedback, a different perspective, and someone to trust. \n\nBootstrapping is personal financing a project through any means possible. Bootstrapping successfully for long period of time is indicative of future success. Bootstrapping is also uncommonly successful and very difficult."},{"id":95,"title":"How to Take Smart Notes ","author":"Sönke Ahrens","content":""},{"id":86,"title":"What is Success","author":"Evan Czaplicki","content":"https://www.youtube.com/watch?v=uGlzRt-FYto"},{"id":60,"title":"Why you don’t really know what you know","author":"Matthew Hutson","content":"https://www.technologyreview.com/2020/10/21/1009445/the-unbearable-vicariousness-of-knowledge/\n\nWhat does it mean to know something? Knowledge they define as \"justified true belief,\" facts you can support with data and logic. As a collective, we rely on Epistiemic dependence to know things. As a consequence, we have less knowledge on actual things stored in our own minds than we think. However, we use transactive memory to know who knows something and thus perhaps know more than we think as a collective. Society has increasingly relied on systems of collaboration and Epistiemic dependence as fields of study have gone deeper and narrower over time. We are encouraged to trust experts over our own conclusions in certain areas of study to save time and come to a more accurate conclusion. Exposing your Epistiemic knowledge through explanation can show where you have high dependence on the phenomenon and are lacking concrete facts held in yourself and relied on others explanations. "},{"id":49,"title":"ChooseFI podcase Episode: The Simple Startup","author":"Jonathan Mendonsa & Brad Barrett","content":"n/a"},{"id":43,"title":"Towards The Understanding Of Interaction In Information Visualization","author":"Ana Figueiras","content":"[Source](https://www.researchgate.net/publication/283855695_Towards_the_Understanding_of_Interaction_in_Information_Visualization)\n\nData visualization is as a tool to help give meaning and insight to abstract data. This paper proposes that interaction is a part of data visualization. The effect on cognition/understanding when interaction is introduced to data visualization is varied not causuly known. This paper proposes that one reason for this is that the world does not have a wholistic view of what interaction is and encompases. There are a few reasons for this. Data visualization techniques continue to evolve and grow. As of 2015, there is no accepted standard for data visualization categories. To have a holistic view of interaction, this paper attempts to solve the lack of categorizing in visualization. For refererence, the visualizations Ana collected are documented [here](https://rethinkingvis.com/#all).\n\n### Interaction Categories\n1. <strong>Filter:</strong> This enables a user to reduce complexity to help cognitive load or to focus in on details. This is usually done by specifying a range of condition. Long delays between user filter request and machine response have shown to be detrimental to user experience and negatively affects user insight derived from the visualization.\n\n2. <strong>Select:</strong> This enables a user to mark or track items of interest. This technique is often used in conjunction with others. For example, when an item is selected often that action is coupled with changing the visual representation of the data or offering details on demand, more detailed information about the selection.\n\n3. <strong>Abstract/Elaborate:</strong> This enables a user to change the level of detail/abstraction for interpretation. <strong>Zooming</strong> allows users to remove detail/data points from view and show more detail about selected data points. Zooming out does the reverse and adds previously hidden contextual information back to the viewport. This helps aid cognition in recognizing meaningful patterns within data. <strong>Details on Demand</strong> provides users additional information upon a selection, often a click or hover state. Drill down options in tree diagrams use this technique.\n\n4. <strong>Overview and Explore:</strong> This enables a user to see the entire represntation of a dataset. This can allow for insight that was only possible with the entire context of a datasets shape. Due to dataset size and other technological constraints, representing all data in a visualization may not be possible. Panning can be introduced when this constraint exists. This can be likened to a camera moving across a larger visualization. Often, there is a visualization to show how much of the entire visualization is being covered by the current viewport.\n\n5. <strong>Connect/Relate:</strong> This enables a user to more clearly see view relationships between data. THis can manifest as highlighting similar data across multiple different graphs or physically linking data with highlights.\n\n6. <strong>History:</strong> This enables a user to see the history of their interactions and potentially undo their interactions chronologically. This is highly associated to the exploration of data within a visualization. This aids a user to refine insight and make mistakes which can save user time. This also frees users from fear of not getting back to a certain view and can give users the freedom of exploring data further.\n\n7. <strong>Extraction:</strong> This makes it easier for users to save or share derived insight from data visualization. This can manifest as translating query parameters across visualization or exporting content to different mediums.\n\n8. <strong>Refigure and Encode:</strong> This gives user more direct control over the visualization to tranform it to gain insight. Possible examples of these techniques are allowing a user to change spatial reprentation of the data by ordering ascending when it was descending data points. This can also manifest as changing data groupings and colors.\n\n9. <strong>Participation and Collaboration:</strong> This enables more than 1 user to contribute to understanding and interpretation of a visualization. This is motivated from human psychology. Sensemaking and data interpretation are social activities and offer benefits that were harder or not possible on an individual level from anything like insight derived to additional engagement. Techniques that allow for social insight include tags, links,bookmarks, doubly linked discussions, graphical annotations, comments, etc. Often, comments are the only technique used within this category as these can be difficult to implement.\n\n10. <strong>Gamification:</strong> Indulsion of game mechanics or game design patterns can improve the user experience and engagement with the content. Examples include narrative context, reputation mechanics, levels, time constraints and goals."},{"id":41,"title":"The life-changing magic of tidying up","author":"Marie Kondo","content":"Employing the Kon-Marie method not only tidies the house but can give perspective and life-style change. Kondo throughout the book relates her life story as it applies to her tidying journey and how she came to the method that she teaches today. First, kondo motivates the need for a tidying education in the first part of the book. She asserts taht tidying is not formally taught in any capacity, school or from parents. She has also observed that tidying is not usually learned through experience. Therefore, it takes dedicated study to learn to tidy. Kondo motivates the need for a good tidying method further by saying existing tidying methods and idealogy are not often successful and result in rebound to a messy state. Tidying involves answering two questions about items in question, \"Should i get rid of it?\" followed by \"Where should I put it?\". Additionally, to prevent rebound she asserts that a lifestyle change is neccessary to not build up clutter again. \n\nThe Kon-Marie method optimizes being surrounded by happiness in the household. The method is to systematically work your way through every item in your house broken down in order by category (clothes, books, papers, komono, mementos). You must hold each item close to you and ask if that item brings joy to you. It is important to keep in mind here that we are asking what to keep, not what to get rid of which is starkly different to common tidying methods. If the item does not bring joy, thank it for it's service to you and move on from it. If the item does bring joy, you keep it and decide where to put items after discarding is done. There is a little more nuance but that is basically it. \n\nShe has a few suggestions for storage of items and how to start the process. She says before starting the process, take time and envision the space you want to live in to give clarity to decision making. She also suggests when deciding places for storage, optimize the decisions around ease of putting away. If something is easy to put away, it will be less likely to add to clutter in the future. Every item having it's own place in the house is also important to avoid clutter. Further, vertical storage is preferred to horizontal and when folding clothes try to aim to fold into a rectangle. Sentimental items can be difficult to discard even though they no longer bring you joy. To deal with this case and others, Kondo suggests to ask what the purpose of the item was and has it already served it's purpose. Kondo also suggests to store papers by category, papers to deal with and documents needed to keep. Keep each in a separate place, perhaps a bin or clear folder.\n\nThe mindset change is a big part of the Kon-Marie process. She recognizes that it is tough to change your mind or habits. To address this Kondo asks that you do her process all at once instead of little at a time. This is so you see results immediately and allow the best opportunity to change our mind. Kondo asserts that we can build empathy for messier individuals after being confronted by many decisions through the process. Through this process you will naturally have more appreciation for what you own and also build further appreciation for what you own. Kondo relates her experience that after her clients complete her method they have new-found clarity in their life. They are more decisive in their wants and desires out of life and act on this. This could be because they have been training their decision making process and fine-tuning what brings them joy among their possessions.\n"},{"id":39,"title":"Start Something That Matters","author":"Blake Mycoskie","content":"The Tom's story is about a company that helps fight poverty by giving a pair of shoes to someone for every shoe sold. Blake believes in the power of story. He argues that a good story is an effective way to influence people. That could be influencing them to care and buy your product or work with you. He asks for the reader to find the story they care about, refine it and share it with everyone.` \n\nFear is the apprehension of future events. Fear can influence us into not taking actions we ewant to do. Fear is ineveitable. Our response to fear is not. There are many techniques and ways to overcome fear. You can find situations that mirror the one you're fearful about and see the results to lessen uncertainty about your own situation. Transfer the fear from inside the mind to another medium like spoken or written to get a new perspective on the fear and impact of fear. Waiting for the right time to act may be a poor strategy as this stems from fear of acting.\n\nBe resourceful without needing resources. A lack of resources can make shape decision making positively as this situation reinforces ingenuity and frugality. A lack of resource at onset can even be correlated to future success of a project/company. Traditional things like office space are not neccessary to succeed today.\n\nSimplicity makes business easier. Simplicity makes decision making easier, working with others easier, and communicating about your business easier. Simplicity offers clarity of thought not just in business but in the personal life as well. This clarity of thought can spur the individual to action and allows them to focus on their values.\n\nHigher levels of trust in and about a company is correlated to higher levels of success. Trust is built over time. A leader can foster a culture of trust by embodying the \"servant leader,\" leading through empathy rather than authoritarian practices. Transparency can be a key element to foster trust. Giving individuals autonomy and room to make and learn from mistakes can be critical to building trust. Actions that break trust can be devastating to a company and fixing this mistake can be very costly. \n\nCharitable work as a core part of the business is advantageous as people have a predisposition to want to work for and be part of charitable work. There is also great personal satisfaction for many people in giving back. The best time to make charitable work a core part of the business is at the very beginning so it is part of the DNA of the company. Give early, give often and give thoughtfully. Money is fine to give but think about the core competency of your business and try to be charitable in that way. For example, a shoe company can donate shoes to poverty stricken countries rather than give money to a foundation in that country. The advantages here are a greater sense of engagement and sustainable effort.\n\nStart something that matters. If you haven't started already, start today."},{"id":37,"title":"Make Data Structures","author":"Richard Feldman","content":"Make Data Structures is a live talk by Richard Feldman found [here](https://www.youtube.com/watch?v=x1FU3e0sT1I)\n\nRichard compares and contrasts different ways of building software applications. Building with blocks is an OOP style where components are built in isolation and then stitched together. In this approach, isolated problems are higher priorities than structural problems. This can be a problem as structural problems have a high cost to fix when the code is already implemented. Richard advocates in Elm to create data structures before writing any code. This is a thought exercise where you solve for structural problems before problems in isolation solving for the previous problem. This involves going through a cycle of building, discovering, and re-structuring until the structure can be realized with implementation. In Elm, building data structures can be done by mapping project requirements to custom types and further refining handcrafted/union types until structural problems are solved. He asks to default to \"opaque\", cannot be modified, types with accessors and mappers instead of allowing use of the implementation. \n\nHe brings in one more semi-unrelated theme of learning by doing. He thinks one of the best ways to learn is to just learn by getting deep in code without knowing what is proper and figuring out the proper way to do things later."},{"id":35,"title":"Let's launch a satellite to track a threatening greenhouse gas","author":"Fred Krupp","content":"https://www.ted.com/talks/fred_krupp_let_s_launch_a_satellite_to_track_a_threatening_greenhouse_gas?language=en#t-498130\n\nMethane emissions are a leading factor contributing to climate change. Fred Krupp and co are launching a satellite to track these emissions across the globe and make this data publicly available and easy to access. Their goal is to reduce emissions by 45% by 2025. They think this is the course of action to do this for the following reasons. Reducing methane emissions is one the of the most impactful actions they can take. When a leak is identified, it is usually simple and low cost to fix. People are incentivized to help and fix these leaks when this data is provided to them. He speculates this is one of the lowest cost, highly effective ways to combat climate."},{"id":33,"title":"its-just-darth-vader","author":"Elmtown Podcast","content":"Elmtown Podcast found [here](https://elmtown.simplecast.fm/its-just-darth-vader)\n\nAziz Erkal is the guest of this episode. He created [Kite, an interactive visualiztion tool for graph theory](https://github.com/erkal/kite). Graph theory is the study of graphs where graphs are a mathematical structure to represent relationships between objects. This manifests as a collection of edges and vertices which can be used to model many parts of life like social networks. Erkal is a mathemetician who wanted to an interactive graphing tool to help him in his work. He started to build this tool in javascript but was slowed down for a couple of reasons. Coming from mathematics, an imperative language like Javascript where the state of the variable could change confused him. He moved to Elm to be more in his comfort zone working with a declarative language. Because he didn't know what exactly he wanted to build as he was building, the freedom that came with re-factoring in Elm was beneficial. D3.js is the biggest known graphical library for the front end and he used that to interoperate with Elm at first before eventually re-factoring to use only Elm as dependencies for his tool He found the elm-geometry and elm-ui great libraries to work with in Elm and was encouraged by talks from the Elm founder and major contributor, Evan and Richard. He benefit a lot from the elm-community so he decided to make one of the latest features for Elm itself to give back to the community. "},{"id":31,"title":"D3JS Data Visualization Fundamentals","author":"Lars Verspohl","content":"Pluralsight course by Lars Verspohl\n\nLars covers D3.js in depth at a conceptual level and shows examples to illustrate the concepts covered. To have an in-depth understanding of what D3.js offers, he has to introduce the audience to other concepts fundamental to creating data visualization.\n\nD3 is a low-level Javascript Library for manipulating the document object model(DOM) with data. D3 is a collection of modules. The core abstraction it offers is binding data to dom elements. By binding data to dom elements, the dom elements can size, transform, shape, color themselves to the specification creating informative visualization. The data join produces data categorized into differnt data change states; enter, update and exit state. D3 uses web technologies (HTML, SVG, CANVAS) to actually do the drawing in the DOM. D3 offers many helper libraries on top of the core data join abstraction. This ranges from functions to help scale data to the screen/pixel locations to stratification of data for hierarchical structure to user interaction infrastructure to capture user and browser events.\n\nD3 is a low-level library. It offers a lot of control of dom manipulation to the user. Because of this it can have a higher learning curve to use than other higher-level libraries that require the user to know less. The following concepts are all useful to know when working with D3.\n\n- General Update Pattern: This pattern exists to take advantage of the D3 data join. As a consequence, code becomes structured to abstract dyanamic parts of the code from static.\n  - Create or get an existing d3 dom element, join new data to this element to create the data state categories, then deal with each category of data states programatically\n\n- Visual Design: This is a field of study to enhance usability/readability and reduce cognitive burden for understanding visuals. Understanding visual design concepts and patterns is key to making more effective visualization.\n  - Transitions are used to reduce cognitive load by making it easier to follow data. They help maintain object constancy.\n  - Interactions have many different consequences as there are many different types of interactions available with data visualization. For example, Highlighting can reduce distraction while tooltips can serve additional information about a data point.\n  \n- SVG: Lars focuses on using SVG as the drawing tool. SVG defines a canvas of an absolute pixel length. This canvas accepts children elements like line, circle, and text. SVG offers the ability to group children together and apply transformations to the group.\n\n- Re-usable module pattern: The intent is to create modules to share configurable data visualizations created from D3. It suggests to have sensible defaults for configuration and use chainable function calls after object instantiation. One way this can be achieved is via closure.\n\n- Data Structures: It is impossible to create certain visualization unless data is structured in a way that allows for it. D3 has some helper libraries to move and re-structure data. It is important to understand what kind of data, format of data, and structure of data to know what visualizations are then possible to create to answer questions about the data.\n\nLars also offers a couple systematic approaches to common problems. \n\n- For data visualization in general, he recognized this cycle. \n  1. Define the goal\n  2. Source, shape and clean the data\n  3. Draw the data\n  4. Collect insight\n  5. Refine goal\n  6. Go back to step 1 if not satisfied\n\n- For drawing data, Lars recognized this pattern.\n  1. Sketch desired visualization\n  2. Fetch and transform data\n  3. Chart dimensions\n  4. Calculate scales\n  5. Join data and draw\n  6. Add Axis \n  7. Refine drawing"},{"id":29,"title":"Climate change means the US must start building big things again","author":"James Temple","content":"https://www.technologyreview.com/2020/01/15/130892/climate-change-green-infrastructure-us-public-works-building-boom/\n\nHuge amounts of infrastructure need to be in place to combat inevitable climate change. This is a problem because the U.S. has been very slow at building new things and rebuilding old things. The author slides to this being the result of public a us government designed to make slow decisions. There are two instances in the past of the US building things quickly, both when the federal government stepped in to combat economic downturn new deal. The author also says that the US must change public sentiment towards climate change to an immediate threat to get major traction on public projects like these"},{"id":27,"title":"Artificial general intelligence: Are we close, and does it even make sense to try?","author":"Will Douglas Heaven","content":"https://www.technologyreview.com/2020/10/15/1010461/artificial-general-intelligence-robots-ai-agi-deepmind-google-openai/?utm_source=engagement_email&utm_medium=email&utm_campaign=site_visitor.unpaid.engagement&utm_term=editor-favorites&utm_content=12.20.subs&mc_cid=7baa7ebed7&mc_eid=56dbda6dfa\n\nAGI (Artificial General Intelligence) is more of a dream/vision than a concrete definition. Suposedly the last invention man will have to make, AGI is the concept of machines having general human-like intelligence with the capacity to learn new tasks exponentially and have a conciousness or some combination of these ideas. This concept divides AI researchers, some are focused on closer/easier to solve problems while others have this dream as the motivating factor. For AI researchers, managing expectations of research results is important as unrealistic expectations in the past have dried up research funding for a quite a while. AI today has advanced to a one-algorithm model where AI can do one thing exceedingly well through deep-learning/Neural Networks. To advance further to generalize these AI, there are some methods like transfer-learning, implementation of \"common sense\" and others that could be a next step. Future visions of AGI seem to have a few camps. One that this can be a brute force problem and we will eventually achieve it by massive computation. Another is that we have to map the model of the human mind more precisely and replicate that in machines. And of course, many think that a combination of both will get us closer to AGI. Advances in AI today don't necessarily mean that we have gotten any closer to AGI and timelines for AGI are nebulous given it's nature."},{"id":25,"title":"Lie detectors have always been suspect. AI has made the problem worse","author":"Jake Bittle","content":"https://www.technologyreview.com/2020/03/13/905323/ai-lie-detectors-polygraph-silent-talker-iborderctrl-converus-neuroid/?utm_source=engagement_email&utm_medium=email&utm_campaign=site_visitor.unpaid.engagement&utm_term=editor-favorites&utm_content=12.20.subs&mc_cid=7baa7ebed7&mc_eid=56dbda6dfa\n\nThere is huge interest in the ability to detect deception. The limitations of polygraph tests are well known. There are now many projects and companies developed to produce deception detectors using AI/deep learning to develop complicated models to solve these problems. There are many criticisms of these technologies. In the article, critics often pointed to small training and test data sets that may show these technologies to be unreliable when put in real world settings outside of controlled labs with homogenous test subjects. Further, there is a lack of pyschological research that states that deception can be correlated to human behaviors that also can be generalized to all humans. There were also ethical and moral concerns regarding building products like these that could erode human trust, especially in cases where the model was incorrect. Because the science behind these technologies is not trusted with what the technologies are being used for, the article conveyed that we are far away from a legitimate lie detector.\n\nI found it interesting that some companies were founded off of research insights. Like, X research was done to and now we have Y insight about the human behavior/science/other/etc. Is this a common pattern for companies? Have an insight and build technology around it that solves problems? Example from this article is research was produced to correlate behavior between emotions and mouse movements. Then someone built a company around it to detect fraud. "},{"id":23,"title":"Advanced CSS Concepts","author":"EdX by Microsoft","content":"Course on EdX by Microsoft\n\nA characteristic of responsive web-sites is it serves content optimized for a variety of accessing devices from phone to desktop. This course was designed to show the different tools the browser offers to help make webpages responsive. Media queries return information about the client window size and viewport. A common pattern is to set different layouts with grid/flexbox based on threshold/breakpoint of what size is returned from these queries. Further, the information from these queries can be used to optimize things like the reading experience and pixel resolution for images. When building layouts, the instructors advised to start designing with the smallest device as default and going from there.\n\nThere are other tools to aid in crafting webpages. CSS modules are intended to break bigger pages into self-contained, re-usable building blocks. There are many design patterns/paradigms to using these modules like OOCSS and SMACSS. Building scalable CSS modules that is easy to interpret and re-factor requires abstraction between layout and positions. As a tip, relative and absolute positioning are powerful tools within CSS to achieve desired layouts.\n\nBe mindful that different browsers have different features because a webpage may not work on all websites if key features are missing. There are tools to help detect, test, and polyfill missing features. These tools allow for the flexibility of programatically dealing with missing features."},{"id":21,"title":"Why Are People Still Starving?","author":"Bobbie Johnson","content":"https://www.technologyreview.com/2020/12/17/1013213/hunger-starvation-food-policy-history/?truid=&utm_source=the_download&utm_medium=email&utm_campaign=the_download.unpaid.engagement&utm_term=&utm_content=12-18-2020\n\nThe world as a whole has gotten worse at feeding everyone. More people are starving in 2020 than in 2014. (Is a higher percentage or lower percentage?) The root causes of starvation are known but have not been addressed. The world produces enough food to feed everyone yet millions starve. Some blame this partially on indstrialized nations subsidizing food and exporting to countries undercutting local competition. This never gives them a chance to rise out of the circle of poverty. Additional challenges may be on the horizon as well. People have forcasted water shortages due to climate change leading to a reduction in agriculture capabilities and less food to go around."},{"id":19,"title":"User Interface Design For Programmers","author":"Joel","content":"Source here: https://www.joelonsoftware.com/category/uibook/\n\n\nPrinciple 1: A well designed user interface behaves exactly as the user expects it to. This is motivated by maintaining the happiness of a user. Tools that do not behave as expected can cause a user to feel helplessness and not in control of their environment. This leads to unhappiness as described by the pyschological phenomenon, learned helplessness. There are two important concepts when discussing user expectations. The user model is a user's idea of how a program works. The program model is how it actually works. Talking to users and conducting experiments with users is often the best way to discover the user model. It's often much harder to change the user model and much easier to change the program model to adhere to the user model. \n\n\nPrinciple 2: Every option given to the user is a choice the user has to make. Making choices isn't inherantly bad, but making choices about something the user doesn't care about is certainly bad. \n\n\nWhen the user model is not well defined, metaphors and affordances are techniques to help shape and guide the user model. \n\n\nIn practice, users often exhibit these behaviors:\n- Users hate reading\n- Users can't use the mouse very well\n- Users can't remember anything\n\n\nActivity Based Planning is designing a ui around activities a user intends to do with the application. This is in contrast designing around the capabilities of an app. Activity Based Planning is meant to have user centric design and make these activities as easy for the user to do as possible."},{"id":17,"title":"The Now Habit","author":"Neil Fiore","content":"Why do we procrastinate? We procrastinate to cope with fear/anxiety over starting/completing tasks. This fear/anxiety can be rooted in different places in our ego. Procrastination can be rewarding and serve temporary relief in the face of our fears. A fear of failure, fear of success, gaining percieved control, and expressing resentment are all root causes of procrastination. \n\nPeople are often bad at time management and truly assessing how much time has passed in situations that are emotionally charged. This can lead to a lack of awareness over procrastination patterns since procrastination is tied with fear. Gaining awareness over these patterns can turn percieved wasted time to percieved productive time. \n\nA resilient self worth protects against procrastination as procrastination can be used to protect our self worth. If I tied my self worth into my activities and percieved success of those activities, I can protect this self worth by not giving myself the proper time to engage with the activity and procrastinate instead. This way I do not allowing myself to see what the output of work would have been at 100% capacity and thus my self worth doesn't deprecate if the work turned out below my standard. \n\nHow we talk to ourselves has an impact on our subsequent actions. Negative self talk puts someone into a victim mindset, removes percieved control over situations, and diverts energy from the task at hand to thoughts of what to do if they ahd control of the situation and were not a victim. Negative self statements are generally started with \"I have to\" or \"I should.\" Positive self talk gives control back to the individual and removes core reasons for procrastination. These generally start with \"I am\" or \"I will.\"\n\nLarge projects and high amounts of uncertainty can lead to action paralysis and procrastination. A pattern to deal with that is to break down bigger tasks towards smaller, easier to digest tasks with a focus on starting work when possible rather than having it complete by a certain time. This pattern restores focus and action.\n\nProcrastinators and workaholics are trapped in a cycle of working or feeling guilty about not working. Guilt free play can break this cycle. Play is important to re-energize and re-vitalize the mind and body. Play is what teaches children the excitement of discovery and showcases humans innate creativeness. Everything is play to a child and learning needs no motivation in that mindset. Later in life adults are taught that work is hard and painful. People reach for procrastination as relief from this pain. \n\nThe pull method of motivation capitalizes on human tendency to be motivated to work productively when incentivezed with pleasure and success as a reward rather than the push method which is characterized by working to avoid pain. Often when people are motivated with the push method, procrastination is reached for to avoid pain rather than working to avoid pain.\n\nCoupling guilt free play with the pull method of motivation can maximize time spent on focused, quality work. \n\nGuilt free play is also conducive to taking advantage of the Ziegarnik effect, letting the subconcious mind work on problems not put down in the background while the concious mind is occupied.\n\nFear of failure, terror of being overwhelmed, and fear of finishing are al fears that lead to inaction. These fears have multiplicative effect on one another. It's possible to overcome these fears with a systematic approach. If overwhelmed, take smaller steps. If you fear failure, expose your fear. Fear finishing, expose your fear. These all move to language and actions of producers.\n\nSystems/Systematic behavior is successful at giving control over an indivdual's behavior. The UNSCHEDULE is a system meant to give the perception of control back to the suer as awell as foster an attitude of guilt free play, emphasis on starting rather than finishing, clarity around how time is used and how much is available, and uses methods from psychology to get there.\n1) Schedule only\n  - Previously commited time such as meals, sleep, meetings\n  - Freetime, recreation, leisure reading\n  - Socializing, lunches, and dinner with friends\n  - Health activities\n  - Routing structured events\n2) Fill in Unschedule with work on projects only after you complete one half hour\n3) Take credit for periods of work that represent 30 minutes of uninterrupted work\n4) Reward yourself with a break of change to a more enjoyable task after each period worked\n5) Keep track of # of quality hours worked each day/week\n6) Always leave one full day a week for recreation and small chores\n7) Before deciding on recreation or social commitment, take 30 minutes for project\n8) Focus on starting\n9) Think small\n10) Keep starting\n11) Never end \"down\"\n\nOur brain has two functions/states. Survival function and creative function. The focus and concentration needed to do quality work motivates using the flow state. This is when our creative function takes over and we reach heightened levels of calm, focus, and attention. It is possible to reach this state at will by daily meditation and training. This states puts aside the critical and logical survival function of our brain to focus on creativity. This release the mind from the constraints of the survival function. (What are the constraints of the survival function?) The creative function can create wider ideas that can be the first draft/steps to quality work. Taking the time to get into the flow state before critical meetings, critical work, or job interviews can lead to success with those tasks.\n\nIndividuals who expect and embrace setbacks often experience higher levels of success. We can train ourselves to not be ovewhelmed by setbacks and embrace them, it is not an innate trait that cannot be changed. One method of traiing is to artificially plan a setback and conciously listen and pay attention to how we are feeling during the setback. Familiarizing ourselves with this feeling can give the necessary familiarity and experience necessary to recognize setbacks in real time and embrace them. This will slowly change negative habits into positive habits from the view of a producer. Mental rehearsal in general is an effective tool to unlock optimized performance or uncover blockers in work. \n\nDistractions while working can impede progress. Helpful patterns to work with distractions are to confront them or compartmentalize them/\"put them down\" with the ziegarnik effect telling your mind to release the thoughts as you will deal with it later. \n\nGoals are a good tool to add agency to work and provide an impetus for quality work. Identifying goals that are worth striving towards in the first place is a worthwhile endeavor as this will give the motivation necessary for work. Helpful goals are measurable as in you can identify progress on them and if they are achieved. Helpful goals are also usually able to be broken down into subgoals. These goal characteristics help utilize the pull method of motiviation and identify measurable points of progress that can then reward the goal setter and worker.\n\nWorking with procrastinators in life requires empathy. Empathy is used to understand a procrastinators root causes for procrastination and work with them with those root causes in mind. Using language of a producer along with techniques like constructive feedback, clear communication, rewards for success, and decisiveness will help procrastinators as a support for them to tackle the underlying issues of procrastination and set them up for success."},{"id":15,"title":"The Life of a File","author":"Evan Czaplicki","content":"A live talk by Evan Czaplicki found [here](https://www.youtube.com/watch?v=XpDsk374LDE)\n\nThe premise to this talk was this question. \"How do you grow Elm code?\" Evan thought this question was rooted JavaScript context. This context asserts that with JavaScript, the chance of a mutation induced bug goes to 1 as a code file grows larger. The other is that there is risk in breaking the system with refactoring because of un-seen mutation. These are not problems in Elm. Elm is declarative and has a compiler to help with refactors. So, this dismisses a common held notion that large files are inherently bad. \n\nEvan showed an example of two very similar views in a UI. These only appeared similar as the business and logic requirements ended up being quite different between them. The resulting data structures thus were quite different between them. Each file ended up with different custom types to accompany the differing requirements and made it logical to separate the type and logic around the type into it's own file. Evan recommends to do this organically. He asks not to introduce pre-mature generalization or refactoring as this could end with the wrong abstraction. To prevent future bugs with shared code, he said to limit what the module exposed to only what was absolutely necessary. By not exposing the implementation of the type, future bugs can be avoided. If a module/custom type was used in 10 places in the code, a refactor to the underlying implementation of the code should not cause bugs with those 10 places if the public api remains the same.\n\nReally focus on the data model. Solve problems in front of you, not potential future ones."},{"id":13,"title":"Stop Using A Loading Spinner There's Something Better","author":"Suleiman Ali Shaker","content":"https://uxdesign.cc/stop-using-a-loading-spinner-theres-something-better-d186194f771e\n\nLoading spinners are often a poor experience for users for a variety of reasons.\n- No feedback to the user on time left ot load or progress\nThis could provoke an emotional response from a user\n- Emotions affect our sense of time.\nA user could percieve more time has passed that in reality has\n- Content loaded after spinner could surprise the user.\nSurprising the user is a risk as this could be a negative experience for a user.\n\nGood progress indicators\n1) Give immediate feedback\n2) *Provide a sense of time (how much has progressed and is pending)\n3) Removes doubt (gradual progress reassures people app is working)\n\nPatterns to replace loading spinner\n- Skeleton Screen - A blank version of the UI loaded incrementally\n- Progressive Loading for images - Load a low quality version of image to serve immediately and load in high quality version of image in background and transition to the image once loaded\n\n*Connection here between push and pull motivation methods. Skeleton screen shifts the focus of attention of the user. Corresponding to pull model, this makes user focus on a positive (progress) than a wait time (negative)."},{"id":11,"title":"Science And Cooking From Haute Cuisine to Soft Matter Science Chemistry","author":"Harvard EdX","content":"[Course on edX](https://courses.edx.org/courses/course-v1:HarvardX+SPU27.1x+3T2019/course/)\n\n**Module 1 - Molecules, Moles, Flavor and pH**\n\nWe can use equations for understanding relationshipss in cooking. Food is made of different molecules. These molecules are classified into 3-4 categories based on their properties. We refer to the number of molucules a substance has with the Mol unit. The molecules will be part of chemical reactions. Chemical reactions are foundational to cooking. Predictions can be made about cooking by understanding what chemical reactions are occuring in the cooking process. We can model chemical reactions with mathematical equations. Dimensional analysis (unit conversion) is a helpful tool to work with mathematical equations. Because cooking often boils down into chemical reactions and balancing equations, being able to perform dimensional analysis is crucial. It lets cooks create different recipes and adapt recipes to ingredients that are on hand.\n\nFlavor is the amalgamation of the sensory experience with food. Sight, smell, touch and taste all contribute. Flavor molecules exist in tiny quantities in our food relative to other present molecules and still have a great effect on what we eat. Acidity affects flavor. It can keep meals lighter on the palate and balance flavor. An acid is a molecule that releases a hydrogen ion. The pH scale standardizes the measure of a substances willingness to give up a hydrogen ion. Many ingredients can contribute to the pH level of a dish, not just the obviously acidic ones like lemon or vinegars.\n\n**Module 2 - Energy, Temperature and Heat**\n\nThe application of heat to transform raw ingredients is a part of cooking. Our bodies use apply heat by burning oxygen to convert food into energy. The principles of energy extraction are the same whether our body is using oxygen to burn fat into energy or we are burning wood to heat our oven. \n\nTemperature is a measure of how active molecules are. When heat is applied to a substance, we are exciting the molecules that comprise the substance potentially causing chemical reactions and change. Common ways of transfering energy to food are burning fuel(gas/bbq) and using electricity(microwave). We can measure how much energy we are transfering by observing the heat source's energy density(joules/kg).\n\nSpecific heat is a measure of the amount of energy(J/kg) it takes to raise a substance by 1 degree Centigrade. We can balance the specific heat equation to find how much energy it takes to raise the temperature of a substance X by Y degrees. The principle of conservation of energy states that energy cannot be created or destroyed. By combining these two learnings we can figure out how long to cook food at and at what temperature if we know what temperature we want food to reach. Water has a high specific heat relative to other commonly used cooking ingredients. One application of this knowledge is that foods that have higher water content have a greater chance of burning mouths when hot. A calorie is the amount of energy it would take to heat 1 Liter of water 1 degreee Centigrade,the specific temperature of water. The 4-4-9 rule can be applied to approximate calories if the weight of protein, carbs, and fats is known. "},{"id":9,"title":"Sapiens: A Brief History of Humankind","author":"Yuval Noah Harrari","content":"by Yuval Noah Harrari\n\n**An animal of no significance**\n\nSapien's 70000 years of history, the study of culture/human social structures, is short compared to the 14 billions of years after the big bang. Similarly, evan a view of the genus Homo shows that sapiens are in their infancy compared to other species of Homo.\n\nIt is uncertain why sapiens rose to dominance and through assimilation or genocide, sapiens are the only species of Homo still in existence. Some sapiens today are uneasy over the fact that there were other species of humans in existence or the notion that sapiens rose to dominance over other species of Homo perhaps by a series of stochastic events rather than coalescing as a superior being.\n\n**The tree of knowledge**\n\nThe cognitive revolution gave sapiens dominance over other species on the planet. This could be because sapiens communication evolved to be flexible enough to cooperate at larger scales than small tribes. The vehicle of this was humans new ability to gossip, talk about others. This could also/alternatively be driven by sapiens gaining the ability to talk about fictional things. This unlocked cooperation on a much larger scale. \n\nFictional entities can have power and exert force on the real world. Fiction broke the limit factor on how cooperation and social systems evolved and changed over time. Without ficiton, cooperation advancements were driven by biological changes. With fiction cooperation advancements could be culture driven. At it's root, these cooperation advancements allows for trust without intimate knowledge of another. Sapiens don't walk on the moon or fly in the sky without these cooperation advancements.\n\n**A day in the life of Adam and Eve**\n\nWe don't know what Sapien life was like tens of thousands of years ago but we have some general knowledge. We care because present day social and psychological characteristics were shaped from sapiens time as hunters and gatherers. Sapiens then could have been considered groups of affluent societies that had long life spans and a lot of time for leisure not needing much relative time for survival compared to the agricultural age humans.\n\n**The flood**\n\nSapiens caused mass exinction as they spread around the world. They could have done this by altering environments they entered and hunting. Evidence for this activity is suggested by fossil records of animals associated to sapien presence. A constant since the cognitive revolution is that sapiens have caused ecological disaster everywhere they went.\n\n**History's biggest fraud**\n\nTHe agricultural revolution increased the world population ath the cost of quality of life. It is thought that no human actively decided to trade quality of life for the benefits of agriculture, but it was a force that once set in motion was irreversible. This force was thought to be set in motion by sapien's motivation for an easier life. The dichtomy of this revolution, work harder for a lower quality of life, is still reflected today by the iron law of history. Luxuries turn into necessities and the accompanying change may not increase quality of life but definately spawn new obligations. Another theory to why sapiens began embracign agriculture was to support building monuments that spanned generations perhaps for spiritual or religious purposes.\n\nFrom an evolutionary perspective, domesticated animals and plants thrived from the agricultural evolution. There were more copies of their dna than ever before. From an individual perspective, this has led animals to lead cruel, punishing lives at the expense of humans.\n\n**Building pyramids**\n\nFor the first time, the agricultural revolution gave sapiens reasons to think about the future. During the agricultural revolution, large scale cooperation was often the effort of many to the benefit of few. This large scale communication was made possible by imagined orders. Imagined orders require true believers to perpetuate and exert force on the world like orchestration of mass-cooperation of sapiens. These believers are created and perpetuated by a couple of phenomenon. The imagined order is embedded in the real world. The imagined order shapes human desires. The imagined order is inter-objective. Imagined orders are probably here to stay. To remove an imagined order, countless people must stop believing in the imagined order. To get that many people to cooperate, you probably need an imagined order. Perhaps a way to break this cycle will come in an evolution in sapiens.\n\n**Memory overload**\n\nWriting was invented to address human brains inadequacy for storing and processing large amounts of mathematical data. Evolutionary pressures pushed sapien cognative capabilities to focus on social, botanical, zoological, and topographic information. The ability to process and store high quantities of mathematical data is not coded into our genes the way breathing and walking is, thus writing. Initial writing was thought to be partial-script meant to solve for inadequacies of the spoken language. Systems of retrieval and cataloguing have shaped the way humans think from free association and retrieval to compartmentalization and burocracy. Today, the language of numbers shapes and is the most powerful language in the world. Binary code and mathematical notation dominate our existence. \n\n**There is no justice in history**\n\nOne iron law of history is that hierarchies justify themselves through divine absolution, not from their actual fictional beginnings. Most sociological hierarchies lack a logical or bilogical motivation. They are usually chance events perpetuated by myths. Concepts like castes and purity have been used to maintain hierarchies. Hierarchies are maintained by punishing individuals from deviating from their given role. The most commonly found hierarchy in history is between male and female. Sex is biological, gender is a cultural construct and constantly evolving. It is not understood why patriarchal societies have dominated history.\n\n**The arrow of history**\n\nHuman culture is constantly in flux. Even a culture left to it's own devices without external influence shifts over time. Cultures are a product of cognitive dissonance and conflicting ideals. This can explain this shift over time. Through the ocurse of history, cultures have trended towards homogeneity. This line of thiking challenges notions of authenticism in culture as people view it today. The three biggest mergers of culture were money, imperialism, and religion in probably that order.\n\n**The scent of money**\n\nMoney is a universal medium of exchange that allows the conversion of any good or service into another. This property of money is enabled by money's quality of being universally desired. Money is a psychological construct that can be easily moved, stored, and exchanged. Money's value is determined by the belief that it has value. It is the most universal and most efficient system of mutual trust ever created. However, the system of trust extends to just money itself, not to the individuals wielding in the money. Money played a significant role in joining and aligning interests pushing human cultures towards unification.\n\n**Imperial visions**\n\nMost people today are the offspring of an empire. Empire is defined by controlling multiple, diverse people/cultures and having flexible borders. There are many different origins of empires in history; conquest, marriage, and democratic to name a few. Empires have a lasting cultural impression long after their death. Empires swallow distinct cultures and produce homogenous cultures. This is evident from the imperial languages that most speak today. An ideaology present in all empires is taht the empire is the one universal truth in the world and the empire is good for all people. Empire cycles look like conqered people assimilating into the empire until viewed as equals and rinse and repeat. In this cycle there is a give and take in cultural identity on both sides. Because most people come from a succession of empires, the concept of authentic cultures removed from empire influence is difficult to find. \n\n**The law of religion**\n\nReligion is a sstem of human norms and values founded on a belief in a superhuman order. Religions that merge cultures and unify humankind are universal and missionary. One religious origin was as a contract to control what humans could not control. Theist religions popular today like Islam and Christianity have borrowed concepts from other dualistic, polytheistic religions to create sycretic religions and by consequence, a powerful uniting force of human culture. Humanist religions sanctify humanity. Examples of these are Budhism, capitalism, and communism.\n\n**The secret of success**\n\nHistory seems to be driven by a stochastic (not deterministic) series of events. Thus, implying why events happened is very hard. This is further muddled by history being a level 2 chaotic system, one that reacts to predictions about itself. Why study history then? To embed the udnerstanding that what sits before us is neither natural, nor inevitable. History/culture can be viewed from memetics perspective; a cultures goal is not to benefit humankind, but to spread itself infecting as many hosts as possible like a mental parasite.\n\n**The discovery of ignorance**\n\nSince the scientific revolution, human power has grown exponentially. The scientific revolution was a cognitive revolution in which humans collectively learned to embrace ignorance on important questinos for the first time. Science collects observations and uses these to construct theories. Statistics was developed to understand and predict phenomenon too complex for simple mathematical formulae. Sciences advancement is not measured in veracity, but in capabilities. The idea that life could change for the better through advancement in human capabilities was thought heretical by most cultures before the scientific revolution. This gave a humans a change in scope of what to work on, from accepting and trying to explain phenomenon to progress and trying to control phenomenon. Economic, political, and religious forces drive much of the direction of scientific advances/the scientific agenda. Science flourishes when paired with a religion or ideology which justify huge scientific cost to further it's own agenda.\n\n**The marriage of science and empire**\n\nEuropeans (specifically Britain, France, and USA) may have started global dominance because they had the advantage of a scientific mindset and capitalist framework. Admitance of ignorance and quest for knowledge were advantages in a world where most cultures assumed the knew what they needed to know. This is supported by european incomplete/partial maps that admit ignorance of what lay beyond known territory. Europeans used science to provide imperial conquests with practical knowledge, technology, and ideological justification. In turn, scientists were provided aveneus to explore and funding to do so.\n\n**The capitalist creed**\n\nThe most important economic resource is trust in the future.\n\nThe scientific revolutoin improved humans trust in the future. This enabled credit instruments to tap into future ventures and allowed economics high growth. Capitalism's creed is \"profit made off of investment should be re-invested in the investment to make more profit.\" This mindest influences ideaology to suggest that economic growth/GDP is the supreme good to maximize. Capitalism has relied on ontinued technological innovation to justify credit lines/and economy built on the promise of the future. Capitalism also shaped and influenced imperial conquest. Imperial conquest was driven by the means to fund the conquest. Capitalism encouraged growth where there was stable government and credit was repaid building trust in the future. Thus, countries that built trust in the future performed well in conquest. One instrument used to finance conquest was stock, a means to distribute risk such that one person doesn't have to incur risk of a venture alone. Stock encouraged and facilitated easier financial investment in the future. The idea that the free market is a rising tide that elevates all those that interact with it has been untrue at times in practice. The slave trade and exploitation of humans in congo were a direct result of capitalism and their lives were made worse.\n\n**The wheels of industry**\n\nThe industrial revolution gave humans the ability to tap into different methods of energy conversion than human and animal muscle and different sources of energy than plants. As a consequence, the economy grew rapidly. Humanist capitalism to this point has disregard the well-being of animals. Animals are scientifically proven to have complex emotional needs. Consumerism accompanied capitalism to buy the mass of goods being produced and flipped the moral compass of frugality most of the world had.\n\n**A permanent revolution**\n\nStandardization and adherence to one notion of time was brough by the industrial revolution. This changed the way everyone lived permanently to this point. Markets and states also permanently changed community and family roles and relations. They took on the responsibility of insurance, welfare, etc.. that were managed by community and family before. Markets and states did this by emphasizing individual needs and powers. This broke the dynamic of communities and families where the power of the individual was weak. To fill the initimacy gaps, imagined communities of national (Germans, Indians) and consumerism (Beyonce, Man U, environmentalists) have come into inter-subjective existence. Modern culture has a preference for peace to war. A human is far less likely to dies at the hands of another human than ever before in the pre-industrial age. The cost of war has gone up dramatically and the benefits of peace have changed substantially. In the past, cultures strove for stability, now cultures strive for change.\n\n**And they lived happily ever after**\n\nCultures are not often evaluated against the happiness increasing or decreasing as a result of change. This is because this is hard to measure, what is happiness? Is it contentment? Who's happiness counts, just humans that are elite in the hierarchy or all humans? Do 16th century slaves or Australian aboriginals factor in to happiness metrics? Are industrial animals counted in happiness measures? How much unhappiness was generated as a result of cultural change/sapien progression? Researchers have attempted ot quantify happiness and look for correlated factors. One finding is that happiness depends on the correlation between objective conditions and subjective expectations. Another view of happiness is that it is driven mainly by biochemistry and peopel have set ranges of happiness that differ from person to person. Happiness could also be an individual seeing one's life as meaningful and worthwhile. Is this self-delusion? Is happiness about knowing and accepting yourself? \n\n**The end of homo sapiens**\n\nYuval theorizes that through some means like genetic engineering, bionic engineering, or something else humankind will evolve past the biological constraints of sapiens. The point at which this happens could be considered a singularity, where all that came before that point is largely irrelevant. If human capability continues to prove many more things are possible, more focus may be put on what and where to take humanity next than ever before."},{"id":7,"title":"On Coding Ego and Attention","author":"Jose Browne","content":"[Article By Jose Browne](https://josebrowne.com/on-coding-ego-and-attention/)\n\nJose's motivation is to become a good software engineer. To be a good software engineer, is to be a good thinker. At a certain point in Jose's journey, becoming a better problem solver was not his limiting factor to being a better thinker. His limiting factor was time and effort spent engaging with the actual problem he was working on solving. \n\nHis ego was his number one distraction limiting to engaging more with problems he faces. The ego conflates self with the problem. This resulted in distraction. Instead of problem-solving, the ego forced Jose to focus on how he was related to the problem. Jose could be questioning if he was smart enough to solve it or shifting focus to easier tasks to inflate the ego. \n\nThe beginners mind is a way of removing the ego as a distraction. Beginners mind is the mindset of the life-long student. The beginner is a sponge for knowledge. The expert makes judgements and decisions on previous knowledge. The beginner uses what is available and adds to their understanding. Distancing ego-self from the problem/task can disarm the ego distraction. This can manifest as \"What is the bug?\" rather than \"Did I cause the bug?\"."},{"id":5,"title":"Making Impossible States Impossible","author":"Richard Feldman ","content":"A talk at elm-conference that can be found [here](https://www.youtube.com/watch?v=IcgmSRJHu_8)\n\nThis line of thinking was motivated by a specification problem. There specification problem was designing an API to transpile Elm into CSS stylesheets. CSS stylesheets have specific ways they must be specified per the CSS specification or they will be invalid for browsers. Richard wrote an api mimicking the look and feel of css stylesheet specification in Elm that was problematic because this implementation needed a validation phase i.e. testing to make sure what was put was valid. To remove the need to validate data collected from the api, a colleague suggested making the state of having an invalid specification impossible. This was achieved by plainly looking at the data that was being modeled and realizing that the data model was not being specified appropriately. By more accurately modeling the data necessary for a CSS stylesheet, Richard made it impossible to specify a wrong stylesheet with the module he was building. Making impossible states impossible in Elm development is the notion to rely on the rigorous type system and compiler to enforce certain constraints of business logic being modeled by software. \n\nRichard gives another idea to module development and breaking changes. He advises when developing a module, to specify the underlying data model as accurately as possible. However, allowing users access to this underlying implementation is problematic for a couple of reasons. The underlying implementation can solve the problem of making the impossible states impossible very well but can make for a tricky user experience. Additionally by exposing the implementation the module is more vulnerable to breaking changes with existing code integrations. Richard advises to follow the pattern of data accessor functions as this pattern will be agnostic to the implementation underneath the module. Personally, this looks a lot like the interface pattern seen in Java applications."},{"id":1,"title":"The Power of Habit","author":"Charles Duhigg","content":"A habit is defined by a decision made once. This decision is repeated without as much thought in future situations until it is like muscle memory. Habits comprise a significant number of decisions people make each day. Habit formation is widely studied. Being able to change/influence habits is the ability to have a great impact on what people do and how they act.\n\nMore recently developed cognitive functions are handled by the outer layers of the brain. The basal ganglia, the center of the brain, controls rudimentary behaviors like breathing and deployment of habits. This is theorized to be because it saves on brain processing power. Brain activity goes down when habits are deployed. The habit cycle consists of a cue triggering a routine, sequence of events, ending in a reward. \n\nCraving is the expectation of reward. Cravings are what drive habits to compulsions. Combining a simple cue with a clear reward that induces craving will heighten the chances of a new habit loop sticking around. Powerful habits create neurological cravings. \n\nOnce formed, habits are very hard to remove. It is easier to alter the routines of existing habits. The golden rule of habit change is to keep the same cue and reward from a habit loop and insert a new routine replacing the old one. This relies on knowing the cue and reward from a habit loop. Identifying the cue and reward from a habit loop can be difficult. Habits can revert to old routines, especially after stressful situations. Belief that behavior can change is a component in changing out routines. This belief can be fostered in group and community settings.\n\nLike individuals, organizations can develop habits. Organizational habits are called routines. Habits that inspire broad change are called keystone habits. These habits have the following properties. \n- They result in small wins. Small wins build momentum and show that larger, broader change is possible. \n- They build a framework/foundation to build other habits off of. The framework can be a non-prescriptive springboard for new habits and change. This framework simplifies decision making. Identifying keystone habits are and what characteristics to target in an organization to build them is challenging. \n\nWillpower/Self-discipline is an attribute in individuals that is correlated to success. Willpower behaves like muscles. They are a finite resource with a limited capacity. Habits can institutionalize uses of willpower in situations where it is needed. Less willpower is used when people have autonomy/agency. When willpower is developed and used in one aspect of life, it can trickle into other parts. Habits built around willpower often use inflection points, points where willpower is needed, as cues and the desired response as the routine. \n\nOrganizations make decisions based on it's routines, habits, and truces. Truces are agreements between factions on how organizations will function. Some organizations craft their routines carefully but all organizations develop them. Organizational routines that have developed without oversight have a higher chance of leading to unstable and toxic organizations. It is very difficult to change organizational routines and truces. Crisis situations make organizations malleable and more open to change.\n\nCompanies can derive habits and profiles from people by analyzing data they have on them. People crave familiarity and familiar patterns. For a company to alter someone's habits, they often wrap something new in familiar things to not shock them and turn them away. People are most likely to change habits when going through a major life event.\n\nMovements often have 3 phases.\n1. Movements start because of social habits of friendship and strong ties between close acquaintances. A strong tie social habit causes someone to act for a strong tie relationship where they may ignore acting for a stranger in a similar situation. \n2. A movement grows because of the habits of a community and the weak ties that hold it together. Weak tie relationships can be described by peer pressure. Weak tie relationships often have more influence than strong tie relationships as they offer access to information and resources that were not already known or readily available. Similar to companies, it was found that the factor underlying decision making was not rationalism but acting on the collective decisions from organizations one is a part of. \n3. Movements endure because movement participants have habits that are self propelling of the movement. They perceive individual ownership of the movement and possible form identity from it.\n\nThere is precedent for the U.S. justice system to recognize that some are not responsible for their actions. Their actions were not driven by conscious decision making but by unconscious decision driven by habit. This book argues that we are responsible for our habits. It takes this view because once someone is aware of a habit, it is possible to change the habit. \n\nFramework: Habit Change\n- Identify the routine\n- Experiment with rewards to isolate the reward\n- Isolate the cue\n  - Almost all habitual cues fit into one of five categories. Writing down the state of these five things at occurrence of routine can help isolate the cue.\n    - Location\n    - Time\n    - Emotional State\n    - Other people\n    - Immediate preceding action\n- Have a plan: Make a plan and understand that not every day will be easy and there will be setbacks."}],"idGenerator":117}